In [14]:
import pandas as pd

In [15]:
#Guarder el archivo en un dataframe
#Delimitaodor por , y no tener en cuenta las dos primeras lineas
df_1 = pd.read_csv('/Users/Admin/Documents/proyectosAnalisisDatos/Pandas/archivo1.txt', delimiter=',',skiprows=2)
display(df_1.head())

  nombre  edad     ciudad
0   Juan    28     Madrid
1    Ana    22  Barcelona
2   Luis    35   Valencia

In [16]:
#El separador es punto y coma
df_2 = pd.read_csv('/Users/Admin/Documents/proyectosAnalisisDatos/Pandas/archivo2.txt', delimiter=';',skiprows=2)
display(df_2.head())

   nombre  edad    ciudad
0  Carlos    40   Sevilla
1   María    30    Bilbao
2   Elena    25  Alicante

In [17]:
#Cuando el separador es un espacio 
df_3 = pd.read_csv('/Users/Admin/Documents/proyectosAnalisisDatos/Pandas/archivo3.txt', delimiter='\t',skiprows=3)
display(df_3.head())

  nombre  edad    ciudad
0  Pedro    50  Zaragoza
1  Lucía    45    Málaga
2   Hugo    33   Granada

In [ ]:
#Cuando el separador tiene un |
df_4 = pd.read_csv('/Users/Admin/Documents/proyectosAnalisisDatos/Pandas/archivo4.txt', delimiter='|',skiprows=2)
display(df_4.head())

   nombre  edad     ciudad
0  Andrés    29  Santander
1   Clara    27     Murcia
2     Eva    34    Córdoba

In [ ]:
#Cuando el separador tiene un separdor con punto y coma dos veces y registar el tipo de dato engine = python
df_5 = pd.read_csv('/Users/Admin/Documents/proyectosAnalisisDatos/Pandas/archivo5.txt', delimiter=';;',skiprows=2,engine='python')
display(df_5.head())

   nombre  edad     ciudad
0   Laura    38     Oviedo
1   Marta    31   Pamplona
2  Sergio    29  Salamanca